
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Движения.КоличествоОшибокДефектодней.Записывать = Истина;
	
	Для Каждого ТекСтрокаПоИсполнителям Из ПоИсполнителям Цикл
		Движение = Движения.КоличествоОшибокДефектодней.Добавить();
		Движение.Период = Дата;
		Движение.Программист = ТекСтрокаПоИсполнителям.Программист;
		Если Не Исполнители Тогда
			Движение.Подсистема = ТекСтрокаПоИсполнителям.Подсистема;
		КонецЕсли;
		
		Движение.Рассмотреть = ТекСтрокаПоИсполнителям.Рассмотреть;
		Движение.Исправить = ТекСтрокаПоИсполнителям.Исправить;
		Движение.Проверить = ТекСтрокаПоИсполнителям.Проверить;
		Движение.Ознакомиться = ТекСтрокаПоИсполнителям.Ознакомиться;
		Движение.Уточнить = ТекСтрокаПоИсполнителям.Уточнить;
		Движение.Прочее = ТекСтрокаПоИсполнителям.Прочее;
		Движение.ПериодНачала = ДатаНачала;
		Движение.ПериодОкончания = ДатаОкончания;
		
		Движение.Исполнители = Исполнители;
		Движение.Ошибки = Ошибки;

	КонецЦикла;
	
КонецПроцедуры
