
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Выберем регистр в который будем писать
	
	
	Если Исполнители и Ошибки Тогда
		
		Регистр = "ОшибкиПоИсполнителям";
	ИначеЕсли Исполнители Тогда
		
		Регистр = "ДефектодниПоИсполнителям";
	ИначеЕсли Ошибки Тогда
		
		Регистр = "ОшибкиПоОтветственным";
	Иначе
		
		Регистр = "ДефектодниПоОтветственным";
	КонецЕсли;
	
	Движения[Регистр].Записывать = Истина;
	
	
	Для Каждого ТекСтрокаПоИсполнителям Из ПоИсполнителям Цикл
		Движение = Движения[Регистр].Добавить();
		Движение.Период = Дата;
		Движение.Программист = ТекСтрокаПоИсполнителям.Программист;
		Если Не Исполнители Тогда
			Движение.Подсистема = ТекСтрокаПоИсполнителям.Подсистема;
		КонецЕсли;
		
		Движение.Рассмотреть = ТекСтрокаПоИсполнителям.Рассмотреть;
		Движение.Исправить = ТекСтрокаПоИсполнителям.Исправить;
		Движение.Проверить = ТекСтрокаПоИсполнителям.Проверить;
		Движение.Ознакомиться = ТекСтрокаПоИсполнителям.Ознакомиться;
		Движение.Уточнить = ТекСтрокаПоИсполнителям.Уточнить;
		Движение.Прочее = ТекСтрокаПоИсполнителям.Прочее;
		Движение.ПериодНачала = ДатаНачала;
		Движение.ПериодОкончания = ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры
